
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;

	ЗначениеРасшифровки = ПолучитьЗначениеРасшифровки(Расшифровка);
	Если ЗначениеРасшифровки.ТекущаяКолонка = "Задача" Тогда
		Если РежимОтраженияТрудозатрат Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеПереходаПоСсылке", ЭтотОбъект);
			НачатьЗапускПриложения(Оповещение, ЗначениеРасшифровки.Jira);
		Иначе
			ПоказатьЗначение(Неопределено, ЗначениеРасшифровки.Задача);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРасшифровки(Расшифровка)
	
	_Результат = Новый Структура;
	
	ДанныеРасшифровкиКомпоновки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ПоляРасшифровки = ДанныеРасшифровкиКомпоновки.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	Для каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
		_Результат.Вставить(ПолеРасшифровки.Поле, ПолеРасшифровки.Значение);
	КонецЦикла;
	
	Возврат _Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеПереходаПоСсылке(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Если КодВозврата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
