
#Область Напоминания

Процедура ЗапланироватьНапоминание(Интервал) Экспорт
	
	ПодключитьОбработчикОжидания("Напомнить", Интервал, Истина);
	
КонецПроцедуры

Процедура ОбработатьНапоминание() Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыНапоминаний", ОбщегоНазначенияКлиент);
	
	ОткрытьФорму("РегистрСведений.Напоминания.Форма.ФормаНапоминания",,,,,, Оповещение)
	
КонецПроцедуры

Процедура ПослеЗакрытияФормыНапоминаний(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ЗапланироватьНапоминание(300);
	
КонецПроцедуры

Процедура СоздатьОтложитьНапоминания(ОбъектыНапоминаний, ОповещениеОПереносеНапоминаний) Экспорт
	
	ПараметрыВводаДаты = Новый Структура();
	ПараметрыВводаДаты.Вставить("ОбъектыНапоминаний", ОбъектыНапоминаний);
	ПараметрыВводаДаты.Вставить("ОповещениеОПереносеНапоминаний", ОповещениеОПереносеНапоминаний);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ОбщегоНазначенияКлиент, ПараметрыВводаДаты);
	
	ПоказатьВводДаты(Оповещение, НачалоМинуты(ТекущаяДата()) + 600);
	
КонецПроцедуры

Процедура ЗавершитьНапоминания(ОбъектыНапоминаний, ОповещениеОЗавершенииНапоминаний) Экспорт

	ОбщегоНазначенияВызовСервера.ЗавершитьНапоминания(ОбъектыНапоминаний);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершенииНапоминаний);
	
КонецПроцедуры

Процедура ПослеВводаДаты(Дата, ДополнительныеПараметры) Экспорт
	
	Если Дата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.СоздатьОтложитьНапоминания(Дата, ДополнительныеПараметры.ОбъектыНапоминаний);
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОПереносеНапоминаний);
	
КонецПроцедуры

#КонецОбласти
