
#Область Напоминания

Процедура ЗапланироватьНапоминание(Интервал) Экспорт
	
	ПодключитьОбработчикОжидания("Напомнить", Интервал, Истина);
	
КонецПроцедуры

Процедура ОбработатьНапоминание() Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыНапоминаний", ОбщегоНазначенияКлиент);
	
	ОткрытьФорму("РегистрСведений.Напоминания.Форма.ФормаНапоминания",,,,,, Оповещение)
	
КонецПроцедуры

Процедура ПослеЗакрытияФормыНапоминаний(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ЗапланироватьНапоминание(300);
	
КонецПроцедуры

Процедура СоздатьОтложитьНапоминания(ОбъектыНапоминаний, ОповещениеОПереносеНапоминаний) Экспорт
	
	ПараметрыВводаДаты = Новый Структура();
	ПараметрыВводаДаты.Вставить("ОбъектыНапоминаний", ОбъектыНапоминаний);
	ПараметрыВводаДаты.Вставить("ОповещениеОПереносеНапоминаний", ОповещениеОПереносеНапоминаний);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ОбщегоНазначенияКлиент, ПараметрыВводаДаты);
	
	ПоказатьВводДаты(Оповещение, НачалоМинуты(ТекущаяДата()) + 600);
	
КонецПроцедуры

Процедура ЗавершитьНапоминания(ОбъектыНапоминаний, ОповещениеОЗавершенииНапоминаний) Экспорт

	ОбщегоНазначенияВызовСервера.ЗавершитьНапоминания(ОбъектыНапоминаний);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершенииНапоминаний);
	
КонецПроцедуры

Процедура ПослеВводаДаты(Дата, ДополнительныеПараметры) Экспорт
	
	Если Дата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.СоздатьОтложитьНапоминания(Дата, ДополнительныеПараметры.ОбъектыНапоминаний);
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОПереносеНапоминаний);
	
КонецПроцедуры

#КонецОбласти

Процедура ИзменитьОписание(Описание, ОповещениеОбИзменении, ВладелецФормы) Экспорт
	
	Если ЗначениеЗаполнено(Описание) Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Ключ", Описание);
		
		ОткрытьФорму("Справочник.Описания.Форма.ФормаЭлемента", ПараметрыФормы, ВладелецФормы,,,, ОповещениеОбИзменении);
	Иначе
		ОткрытьФорму("Справочник.Описания.Форма.ФормаПомощникСозданияВыбораОписания");
//		ДополнительныеПараметры = Новый Структура();
//		ДополнительныеПараметры.Вставить("ОповещениеОбИзменении", ОповещениеОбИзменении);
//		
//		Оповещение = Новый ОписаниеОповещения("ПослеВопросаСоздатьВыбратьОписание", ОбщегоНазначенияКлиент, ДополнительныеПараметры);
//		
//		СписокВариантов = Новый СписокЗначений();
//		СписокВариантов.Добавить(КодВозвратаДиалога.Да, "Выбрать существующее описание.");
//		СписокВариантов.Добавить(КодВозвратаДиалога.Нет, "Создать новое описание.");
//		
//		ПоказатьВопрос(Оповещение, "У текущего объекта ещё нет описания.", СписокВариантов, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВопросаСоздатьВыбратьОписание(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	
	
КонецПроцедуры
