
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РМ_MarkdownСервер.ВставитьПолеРедактированияТекстаНаФорму(ЭтотОбъект, Элементы.ГруппаПредставлениеОписания,
		"ПредставлениеОписания", "ones", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьПредставлениеОписания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеОписания() Экспорт
	
	ПредставлениеОписания = ОбщегоНазначенияВызовСервера.ТекстОписания(Объект.Описание);
	РМ_MarkdownКлиент.ПриСменеСтраницыПоляКомментария(ЭтотОбъект, Элементы.РМ_Страницы_ПредставлениеОписания, Элементы.РМ_Страница_Просмотр_ПредставлениеОписания);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОписание(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеИзмененияОписание", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ИзменитьОписание(Объект.Описание, Оповещение, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияОписание(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Описание) Тогда
		Модифицированность = Истина;
		
		Объект.Описание = Результат;
	КонецЕсли;
	
	ОбновитьПредставлениеОписания();
	
КонецПроцедуры