
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыПоляРедактированияОписания = РМ_MarkdownСервер.НовыеПараметрыПоляРедактированияОписания();
	ПараметрыПоляРедактированияОписания.Форма = ЭтотОбъект;
	ПараметрыПоляРедактированияОписания.ГруппаЭлементовТекста = Элементы.ГруппаПредставлениеОписания;
	ПараметрыПоляРедактированияОписания.ПутьКДанным = "ПредставлениеОписания";
	ПараметрыПоляРедактированияОписания.ВариантПодсветкиСинтаксиса = "ones";
	ПараметрыПоляРедактированияОписания.ТолькоПросмотр = Истина;
	
	РМ_MarkdownСервер.ВставитьПолеРедактированияТекстаНаФорму(ПараметрыПоляРедактированияОписания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьПредставлениеОписания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеОписания() Экспорт
	
	ПредставлениеОписания = ОбщегоНазначенияВызовСервера.ТекстОписания(Объект.Описание);
	РМ_MarkdownКлиент.ПриСменеСтраницыПоляКомментария(ЭтотОбъект, Элементы.РМ_Страницы_ПредставлениеОписания, Элементы.РМ_Страница_Просмотр_ПредставлениеОписания);
	
КонецПроцедуры
