
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		ОбъектыНапоминания = ПараметрКоманды;
	Иначе
		ОбъектыНапоминания = Новый Массив();
		ОбъектыНапоминания.Добавить(ОбъектыНапоминания);
	КонецЕсли;
	
	ОповещениеОПереносеНапоминания = Новый ОписаниеОповещения("ПослеПереносаНапоминаний", ЭтотОбъект);
	ОбщегоНазначенияКлиент.СоздатьОтложитьНапоминания(ОбъектыНапоминания, ОповещениеОПереносеНапоминания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПереносаНапоминаний(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
