

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ПереопределитьЗаголовокПоляСсылкиНаСУЗ();

КонецПроцедуры

&НаСервере
Процедура ПереопределитьЗаголовокПоляСсылкиНаСУЗ()
	
	Представление = Константы.ПредставлениеСистемыУчетаЗадач.Получить();
	Если Не Представление = Неопределено Тогда
		Элементы.СсылкаНаСистемуУчетаЗадач.Заголовок = Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаСистемуУчетаЗадачОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗапуститьПриложение(Объект.СсылкаНаСистемуУчетаЗадач);
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//
//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Описание", Описание);	
//	ТекущийОбъект.ДополнительныеСвойства.Вставить("РедакторОписания", РедакторОписания);	
//
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
//	
//	ОписаниеВХранилище = Объект.ВариантХраненияОписания = Перечисления.ВариантыХраненияОписания.ВХранилище;
//	Если ОписаниеВХранилище Тогда
//		ТекстЗапроса =
//		"ВЫБРАТЬ
//		|	ОписанияПоОбъектам.Описание,
//		|	ОписанияВХранилищах.Хранилище
//		|ИЗ
//		|	РегистрСведений.ОписанияПоОбъектам КАК ОписанияПоОбъектам
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписанияВХранилищах КАК ОписанияВХранилищах
//		|		ПО ОписанияПоОбъектам.Описание = ОписанияВХранилищах.Описание
//		|ГДЕ
//		|	ОписанияПоОбъектам.Объект = &Объект";
//		
//	Иначе
//		ТекстЗапроса =
//		"ВЫБРАТЬ
//		|	ОписанияПоОбъектам.Описание,
//		|	ОписанияВФайлах.РасположениеФайла
//		|ИЗ
//		|	РегистрСведений.ОписанияПоОбъектам КАК ОписанияПоОбъектам
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписанияВФайлах КАК ОписанияВФайлах
//		|		ПО ОписанияПоОбъектам.Описание = ОписанияВФайлах.Описание
//		|ГДЕ
//		|	ОписанияПоОбъектам.Объект = &Объект";
//		
//	КонецЕсли;
//
//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапроса;
//	Запрос.УстановитьПараметр("Объект", ТекущийОбъект.Ссылка);
//	
//	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
//	ВыборкаДетальныеЗаписи.Следующий();
//
//	Если ОписаниеВХранилище Тогда
//		Описание = ВыборкаДетальныеЗаписи.Описание;
//		РедакторОписания = ВыборкаДетальныеЗаписи.Хранилище.Получить();
//	Иначе
//		// TODO:
//	КонецЕсли;
//
КонецПроцедуры
