
Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(ДополнительныеСвойства.Описание) Тогда
		Описание = ДополнительныеСвойства.Описание;
	Иначе
		НовоеОписание = Справочники.Описания.СоздатьЭлемент();
		НовоеОписание.ВариантХраненияОписания = Перечисления.ВариантыХраненияОписания.ВХранилище; // TODO: получать из настроек
		НовоеОписание.Записать();
		
		Описание = НовоеОписание.Ссылка;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ОписанияПоОбъектам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Ссылка;
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.Записать();
	
	Если Описание.ВариантХраненияОписания = Перечисления.ВариантыХраненияОписания.ВХранилище Тогда
		МенеджерЗаписи = РегистрыСведений.ОписанияВХранилищах.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Описание = Описание;
		МенеджерЗаписи.Хранилище = Новый ХранилищеЗначения(ДополнительныеСвойства.РедакторОписания);
		МенеджерЗаписи.Записать();		
	КонецЕсли;
		
КонецПроцедуры
