
#Если Сервер Тогда

Процедура СоздатьОтложитьНапоминание(Дата, Знач ОбъектыНапоминаний) Экспорт
	
	Для Каждого ОбъектНапоминания Из ОбъектыНапоминаний Цикл
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = ОбъектНапоминания;
		МенеджерЗаписи.ДатаВремяНапоминания = Дата;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗавершитьНапоминания(ОбъектыНапоминаний) Экспорт
	
	Для Каждого ОбъектНапоминания Из ОбъектыНапоминаний Цикл
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = ОбъектНапоминания;
		
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли