
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	ЗначениеРасшифровки = ПолучитьЗначениеРасшифровки(Расшифровка);
	Если ЗначениеРасшифровки.Свойство("ТекущаяКолонка") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеРасшифровки.ТекущаяКолонка = "Задача" Тогда
			Если РежимОтраженияТрудозатрат Тогда
				ОбщегоНазначенияКлиент.ЗапуститьПриложениеБезОбработкиОтвета(ЗначениеРасшифровки.СсылкаНаСистемуУчетаЗадач);
			Иначе
				ПоказатьЗначение(Неопределено, ЗначениеРасшифровки.Задача);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРасшифровки(Расшифровка)
	
	_Результат = Новый Структура;
	
	ДанныеРасшифровкиКомпоновки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ПоляРасшифровки = ДанныеРасшифровкиКомпоновки.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	Для каждого ПолеРасшифровки Из ПоляРасшифровки Цикл
		_Результат.Вставить(ПолеРасшифровки.Поле, ПолеРасшифровки.Значение);
	КонецЦикла;
	
	Возврат _Результат;
	
КонецФункции
