
Функция ПредставлениеЗамера(Замер) Экспорт
	
	Возврат Справочники.Замеры.ПредставлениеЗамера(Замер);
	
КонецФункции

Процедура СоздатьОтложитьНапоминания(Дата, ОбъектыНапоминаний) Экспорт
	
	РегистрыСведений.Напоминания.СоздатьОтложитьНапоминание(Дата, ОбъектыНапоминаний);
	
КонецПроцедуры

Процедура ЗавершитьНапоминания(ОбъектыНапоминаний) Экспорт
	
	РегистрыСведений.Напоминания.ЗавершитьНапоминания(ОбъектыНапоминаний);
	
КонецПроцедуры

Функция ДанныеОписания(Объект) Экспорт
	
	Результат = РегистрыСведений.ОписанияПоОбъектам.ДанныеОписания(Объект);
	
	Возврат Результат;
	
КонецФункции

Процедура СвязатьОписаниеСОбъектом(Описание, Объект) Экспорт
	
	РегистрыСведений.ОписанияПоОбъектам.СвязатьОписаниеСОбъектом(Описание, Объект);
	
КонецПроцедуры

Процедура УдалитьОписание(Объект) Экспорт
	
	РегистрыСведений.ОписанияПоОбъектам.ОтвязатьОписаниеОтОбъекта(Объект);
	
КонецПроцедуры

Функция НайтиЗадачуПоСсылкеИзСистемыУчетаЗадач(СсылкаНаСистемуУчетаЗадач) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Ссылка
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|ГДЕ
	|	Задачи.СсылкаНаСистемуУчетаЗадач = &СсылкаНаСистемуУчетаЗадач";
	
	Запрос.УстановитьПараметр("СсылкаНаСистемуУчетаЗадач", СсылкаНаСистемуУчетаЗадач);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции