
Функция ПредставлениеЗамера(Замер) Экспорт
	
	Возврат Справочники.Замеры.ПредставлениеЗамера(Замер);
	
КонецФункции

Процедура СоздатьОтложитьНапоминания(Дата, ОбъектыНапоминаний) Экспорт
	
	РегистрыСведений.Напоминания.СоздатьОтложитьНапоминание(Дата, ОбъектыНапоминаний);
	
КонецПроцедуры

Процедура ЗавершитьНапоминания(ОбъектыНапоминаний) Экспорт
	
	РегистрыСведений.Напоминания.ЗавершитьНапоминания(ОбъектыНапоминаний);
	
КонецПроцедуры

Функция ДанныеОписания(Объект) Экспорт
	
	Результат = РегистрыСведений.ОписанияПоОбъектам.ДанныеОписания(Объект);
	
	Возврат Результат;
	
КонецФункции

Процедура СвязатьОписаниеСОбъектом(Описание, Объект) Экспорт
	
	РегистрыСведений.ОписанияПоОбъектам.СвязатьОписаниеСОбъектом(Описание, Объект);
	
КонецПроцедуры

Процедура УдалитьОписание(Объект) Экспорт
	
	РегистрыСведений.ОписанияПоОбъектам.ОтвязатьОписаниеОтОбъекта(Объект);
	
КонецПроцедуры