
Функция ПредставлениеЗамера(Замер) Экспорт
	
	Возврат Справочники.Замеры.ПредставлениеЗамера(Замер);
	
КонецФункции

Процедура СоздатьОтложитьНапоминания(Дата, ОбъектыНапоминаний) Экспорт
	
	РегистрыСведений.Напоминания.СоздатьОтложитьНапоминание(Дата, ОбъектыНапоминаний);
	
КонецПроцедуры

Процедура ЗавершитьНапоминания(ОбъектыНапоминаний) Экспорт
	
	РегистрыСведений.Напоминания.ЗавершитьНапоминания(ОбъектыНапоминаний);
	
КонецПроцедуры

Функция ТекстОписания(Описание) Экспорт
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Описания.Текст
	|ИЗ
	|	Справочник.Описания КАК Описания
	|ГДЕ
	|	Описания.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Описание);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Текст;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции