
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектОписания", ОбъектОписания);
	
КонецПроцедуры

&НаКлиенте
Процедура Задача(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораОбъектаОписания", ЭтотОбъект);
	ОткрытьФорму("Справочник.Задачи.ФормаВыбора",, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Заметка(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораОбъектаОписания", ЭтотОбъект);
	ОткрытьФорму("Справочник.Заметки.ФормаВыбора",, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Проект(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораОбъектаОписания", ЭтотОбъект);
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Замер(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораОбъектаОписания", ЭтотОбъект);
	ОткрытьФорму("Справочник.Замеры.ФормаВыбора",, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОбъектаОписания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборОписания(Результат);	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборОписания(ВыбранныйОбъектОписания)
	
	Описание = ОбщегоНазначенияВызовСервера.ДанныеОписания(ВыбранныйОбъектОписания).Ссылка;
	ОбщегоНазначенияВызовСервера.СвязатьОписаниеСОбъектом(Описание, ОбъектОписания);
	
КонецПроцедуры