
&НаКлиенте
Процедура ОбъектОписанияПриИзменении(Элемент)
	
	Элементы.Страницы.Видимость = ЗначениеЗаполнено(ОбъектОписания);
	
	Если ОбъектОписания = ВидыОбъектов().Задача Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗадачи;
	ИначеЕсли ОбъектОписания = ВидыОбъектов().Замер Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗамеры;
	ИначеЕсли ОбъектОписания = ВидыОбъектов().Заметка Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗаметки;
	ИначеЕсли ОбъектОписания = ВидыОбъектов().Проект Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПроекты;
	Иначе
		ВызватьИсключение "Неизвестный вид объекта описания."
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СброситьРазмерыИПоложениеОкна();
	
	СоздатьВыбратьОписание = ВариантыСоздатьВыбратьОписание().СоздатьНовоеОписание;
	
	Элементы.ОбъектОписания.Видимость = Ложь;
	Элементы.Страницы.Видимость = Ложь;
	Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗамерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаметкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СброситьРазмерыИПоложениеОкна()
	
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ХранилищеСистемныхНастроек.Удалить(ИмяФормы, "", ИмяПользователя);
	КонецЕсли;
	
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВыбратьОписаниеПриИзменении(Элемент)
	
	Если СоздатьВыбратьОписание = ВариантыСоздатьВыбратьОписание().ВыбратьСуществующееОписание Тогда
		Элементы.ОбъектОписания.Видимость = Истина;
	Иначе
		Элементы.ОбъектОписания.Видимость = Ложь;
		Элементы.Страницы.Видимость = Ложь;
		
		ОбъектОписания = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВариантыСоздатьВыбратьОписание()
	
	ИсходнаяСтруктура = Новый Структура();
	ИсходнаяСтруктура.Вставить("СоздатьНовоеОписание", "СоздатьНовоеОписание");
	ИсходнаяСтруктура.Вставить("ВыбратьСуществующееОписание", "ВыбратьСуществующееОписание");
	
	Результат = Новый ФиксированнаяСтруктура(ИсходнаяСтруктура);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВидыОбъектов()
	
	ИсходнаяСтруктура = Новый Структура();
	ИсходнаяСтруктура.Вставить("Задача", "Задача");
	ИсходнаяСтруктура.Вставить("Замер", "Замер");
	ИсходнаяСтруктура.Вставить("Заметка", "Заметка");
	ИсходнаяСтруктура.Вставить("Проект", "Проект");
	
	Результат = Новый ФиксированнаяСтруктура(ИсходнаяСтруктура);
	
	Возврат Результат;
	
КонецФункции

